In [1]:
import pandas as pd 
a=pd.read_csv(r"C:\Users\abhin\Downloads\students.csv")
b=pd.read_csv(r"C:\Users\abhin\Downloads\details.csv")

In [2]:
a

   StudentID     Name  Marks
0        101    Alice     85
1        102      Bob     90
2        103  Charlie     88
3        104    David     92

In [3]:
b

   StudentID  Age Grade
0        101   20     A
1        102   21     B
2        103   22     A
3        105   19     C

In [4]:
c=pd.merge(a,b,on='StudentID',how='inner')
c
#Inner join prints both the data set which is common

   StudentID     Name  Marks  Age Grade
0        101    Alice     85   20     A
1        102      Bob     90   21     B
2        103  Charlie     88   22     A

In [5]:
c=pd.merge(a,b,on='StudentID',how='right')
c
#Right outer join prints all the right values and the corresponding values and those values which are not corresponding will be printed as NaN

   StudentID     Name  Marks  Age Grade
0        101    Alice   85.0   20     A
1        102      Bob   90.0   21     B
2        103  Charlie   88.0   22     A
3        105      NaN    NaN   19     C

In [6]:
c=pd.merge(a,b,on='StudentID',how='left')
c
#Left outer join prints all the left values and the corresponding values and those values which are not corresponding will be printed as NaN

   StudentID     Name  Marks   Age Grade
0        101    Alice     85  20.0     A
1        102      Bob     90  21.0     B
2        103  Charlie     88  22.0     A
3        104    David     92   NaN   NaN

In [7]:
c=pd.merge(a,b,on='StudentID',how='outer')
c
#Outer join prints the all values right and left. 
#outer join prints the corresponding values from both data sets as it is and those who don't correspond will be printed as NaN

   StudentID     Name  Marks   Age Grade
0        101    Alice   85.0  20.0     A
1        102      Bob   90.0  21.0     B
2        103  Charlie   88.0  22.0     A
3        104    David   92.0   NaN   NaN
4        105      NaN    NaN  19.0     C

In [8]:
d=c.set_index('StudentID')
d

              Name  Marks   Age Grade
StudentID
101          Alice   85.0  20.0     A
102            Bob   90.0  21.0     B
103        Charlie   88.0  22.0     A
104          David   92.0   NaN   NaN
105            NaN    NaN  19.0     C

In [9]:
d.reset_index(inplace=True)
d

   StudentID     Name  Marks   Age Grade
0        101    Alice   85.0  20.0     A
1        102      Bob   90.0  21.0     B
2        103  Charlie   88.0  22.0     A
3        104    David   92.0   NaN   NaN
4        105      NaN    NaN  19.0     C

In [10]:
d.to_csv('merged_students_details.csv')
d

   StudentID     Name  Marks   Age Grade
0        101    Alice   85.0  20.0     A
1        102      Bob   90.0  21.0     B
2        103  Charlie   88.0  22.0     A
3        104    David   92.0   NaN   NaN
4        105      NaN    NaN  19.0     C

In [11]:
"C:\Users\abhin\Downloads\diabetes.csv"

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (2220103931.py, line 1)

In [ ]:
e=pd.read_csv(r"C:\Users\abhin\Downloads\diabetes.csv")
e

In [ ]:
e.head(5)

In [ ]:
print(e.shape)

In [ ]:
e.info()

In [ ]:
e.describe()

In [ ]:
e['BMI'].median()

In [ ]:
e['Glucose'].median()

In [16]:
e['Glucose']=e['Glucose'].replace(0,e['Glucose'].median())
e

NameError: name 'e' is not defined